{
  "_name_or_path": "./tinyGreekBERT_1905",
  "architectures": ["TinyGreekBertMultiTask"],
  "auto_map": {
    "AutoModel": "modeling_tiny_greek_news_bert.TinyGreekNewsBert"
  },
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "tiny_greek_news_bert",
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "num_labels_class": 19,
  "num_labels_ner": 32,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
